---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Edge
source: html/91d78987-d392-ba36-5715-b4410eccb9a4.htm
---
# Edge Members

Returns a curve that corresponds to the edge's parametric orientation.